{
  "date": "2024-06-26T10:07:00.000Z",
  "title": "중간 점검",
  "content": "올해는 6년만에 본가인 충주에서 생일을 맞이했다. 매일 새로운 논문과 연구가 쏟아져 나오며 쉴 새 없이 발전하고 있는 나의 전공에서 벗어나, 풀과 나무가 우거지고 점심 시간이면 캐논 변주곡이 흘러나오는 아파트 단지를 걸으며 이곳의 여유를 느끼면 마치 다른 차원에 와있는 듯한 느낌이 든다.\n\n성인이 되기 전 2년, 그리고 성인이 된 후 2년 반이 지난 지금까지는 매 순간이 격변의 시간들이었다. 성인이 되기 전에는 나의 길이 이공계열임을 확실히 하며 공부에 눈을 떴고, 성인이 된 후 첫 1년을 보내며 그중에서도 데이터사이언스를 나의 전공으로 쟁취했고, 다음 1년은 학교에서 대부분의 시간을 보내며 39학점의 전공 과목을 이수했다. 그리고 최근 반 년간은 이전에 비해 친구들을 더 많이 만나고, 공부 이외의 소중한 것들에 대해 돌아보고자 노력했다.\n\n나에게 있어 시기를 막론하고 time-invariant한 특징이 한 가지 있다면 기록하고 정리하는 일을 좋아한다는 점이다. 노션 등의 툴들을 훨씬 체계적으로 쓰는 친구들은 있지만, 나처럼 가는 곳마다 사진을 찍어두고 시기별로 생각들을 정리하는 것이 습관화된 경우는 드물었다. 돌아보면 이런 나의 성향을 고려해봤을 때, 내가 데이터를 다루는 전공을 선택한 것은 기막힌 필연이었다고 생각한다.\n\n대략 2015년부터 본격적으로 쌓여온 사진과 글들, 그리고 그 때부터 들어온 노래들은 먼 옛날의 나와, 지금 여기의 나와 나아가 먼 훗날의 나를 이어주고 있다.* 스퀘어 한국 신기록을 세운 부산 대회 주변에서 찍었던 사진을 보면 당시 밥먹고 큐브만 돌리던 그날의 치기가 떠오르고, 수능 당일 아침에 고사장으로 가는 길에서 찍었던 사진을 보면 입시와 진로에 대한 고민에 휩싸인 채로 맞았던 서늘한 바람이 느껴지는 듯 하다. Sithu Aye의 Double Helix를 들으면 아직도 수분감을 풀면서 졸다가 깨어나던 내가 보이고, 여자친구의 열대야를 들으면 처음 대학교에 입학하고 많은 것들이 낯설던 생경함이 생각난다. 그리고 이러한 이야기들을 그에 맞는 사진이나 노래와 함께 이야기하는 것이 여가로써 내가 가장 좋아하는 일들 중 하아니다.\n\n이런 나에 대한 기록들은 나의 외장SSD, 티스토리 블로그, 깃허브 블로그에 저장되고 있었다. 그리고 이제는, 모든 것들을 통합해 나에 대한 '온라인 전시 공간'을 만들고 싶어졌다. 내가 찍는 사진들, 남기는 글들, 공부한 기록들, 좋아하는 음악들에 대한 기록들이 이 사이트를 통해 한 번에 정리될 것이다.\n\n내가 찍는 사진들, 좋아하는 음악들, 그리고 내가 하는 생각들을 기록하는 공간. 그런 공간을 만들어낸다는 것은 잠시 쉬어가는 활동이자, 지금까지의 삶을 돌아보는 시간이기도 하다. 최근에는 정말 말도 안되는 우연으로 만난 사람들을 통해 결정적인 도움을 받곤 했는데, 돌아보면 한 편으로는 반대로 과거에 큰 도움을 받았지만 이제 연락조차 하지 않는 경우도 많다. 잊고있는 고마움도 많다는 것을 외면하고 살았고, 이제 그에 대해 돌아보는 시간이다.\n\n곳간에서 인심이 나온다고, 전공과 진로에 대해 폭풍같던 시간들이 지나고 어느정도 생각들이 수렴해가기 시작하니 이런 여유도 부릴 수 있게 됐다. 앞으로의 삶에 있어서도 diffusion term이야 어찌 할 수 없지만, drift term은 확실히 방향을 잡았다고 느낀다. 이제는 금요일 저녁마다 친구를 만나러 가고, 가끔 배드민턴을 치고, 친구 집에서 Wonderwall을 들으며 콘솔 게임을 해보는 여유를 부릴 수 있게 되었다. 현재도 즐거운 일들이 많이 있고, 앞으로는 더욱 행복할 것이라는 기대가 있다. 그런 먼 훗날의 내가 이 글을 다시 읽고 있을 날을 생각하니 그것조차 기분 좋은 일이다. 그때까지 앞으로 어떤 마음가짐으로 살아갈지에 대한 생각은 제법 명학하다. 그것은 코난의 말과도 같다.\n\"Work hard, be kind, and amazing things will happen\".\n\n\n* 허준이 교수의 2022학년도 서울대학교 후기 학위수여식 축사에서 인용"
}
