{
  "date": "2024-10-21T15:31:03.000Z",
  "title": "나의 광기 모음 1",
  "content": "사람들과 이야기를 하다보면 다소 특이했던 경험들, 그리고 내가 생각하기에도 기가 막힌 우연이었던 내 삶 속의 사건들을 모았다.\n\n1. 초등학교 4학년이었던 2013년 6월 14일에 처음 큐브 맞추기에 도전했다.\n그리고 제대로 몰두하기 시작한 것은 초등학교 6학년이 되었을 때부터였다. 중학교에 올라가서도 학교 친구들보다는 네이버 카페에서 만난 랜선 친구들과 큐브에 대한 소통을 더 많이 했고, 부모님을 고생시키며 전국 각지의 큐브 대회에 참가했다. 2번의 한국 신기록을 세워보고, 모르는 사람들에게 온라인 강의같은 것을 해보기도 했던 경험들이 앞으로 일어날 모든 것들의 시작이 될 줄은 나조차도 알지 못했다.\n결국 나는 큐브를 하다가 만난 친구와 같은 고등학교에 진학했다.\n\n2. 고등학교 1학년을 마친 후의 겨울방학이었다.\n매일 독서실에서 고등학교 2학년 과정을 예습하며 삼각함수나 다항함수의 미적분을 처음 접했는데, 공부를 하다가 쉬는 시간에는 유튜브에서 지수함수나 삼각함수의 도함수를 유도하는 영상을 보곤 했다. 훗날 나는 이를 대학교 전과 면접에서 말하게 된다.\n\n3. 고등학교 2학년이 끝날 무렵, '미분과 적분'에 관하여 생활기록부 세특으로 쓸 내용을 생각하던 중 접한 것이 선형 회귀였다.\n당시 알고 있던 이과 친구들이나 기숙사 룸메이트에게 물어보며 손실함수를 미분하여 경사하강을 하는 과정에 대해 알게 되었다. 이 무렵 나는 이게 나의 길이라는 생각이 들었다.\n\n4. 고등학교 3학년 개학을 앞두고 파이썬을 처음 접했다.\n친구에게 물어보니 위키독스에서 Do it! 점프 투 파이썬을 보라고 해줘서 그렇게 했고, 3학년 1학기에는 선형 회귀와 로지스틱 회귀를 파이썬 코드로 돌려보았다.\n이를 바탕으로 3학년 1학기에는 세 과목의 세특을 엮어 학급 친구들에게 설문조사같은 것을 하는 프로젝트같은 것을 했다. 중간고사가 끝났을 쯤 선행 연구를 찾아보고, 질문지를 만들고, 다시 수집했다. 기말고사가 끝난 후에는 수집한 질문지를 직접 파일로 바꾸고, 친구의 도움을 받아가며 회귀 분석을 하는 코드를 돌려보고 발표까지 하니 한 학기가 끝났다.\n당시에는 그냥 한글로 쓰여진 어떤 논문을 읽으면서 그냥 흥미로웠고, 되는대로 하다시피 진행했지만, 돌아보면 그 모든 것들이 제법 의미있는 경험이었다.\n\n5. 수능이 끝난 후에도 나는 밤이 되면 친구와 심야자습실에 가곤 했다. 그리고 그곳에서는 실감이 만들어지고 있었다.\n\n6. 성인이 되고 한양대학교 경영학부에 입학했다.\n내 주변 친구들은 보통 공대로 입학한 후 미적분학을 수강하고 있었다. 나는 그 친구들에게 미적분학 강의자료를 보내달라고 했고, 경영관에 앉아 미적분학의 첫 내용인 엡실론 델타 논법과 삼각함수 역함수의 도함수 등을 살펴보았다. 덕분에 1학년 여름학기가 되자마자 수강한 미분적분학1에서 A+를 받는 데에 도움이 되었다.\n\n7. 1학년 여름방학과 2학기는 아마 실감의 존속에 있어 가장 큰 위기였다.\n발전 가능성에 대한 회의가 제기되었고 그냥 묻어두는 프로젝트가 될 수도 있었다. 이 시기에 내가 나서서 지속적인 관리와 위클리 미팅을 유지했던 것은, 지금까지 내가 실감에 한 가장 큰 기여라고 생각한다. 덕분에 3개월 후 실감의 DAU가 20배 이상 상승하고 많은 유저들의 감사 인사를 받았을 때, 이게 현실인가 싶으면서 생전 처음 느껴보는 기분 좋음을 느꼈다.\n\n8. 대학교 입학 전부터 목표하고 있던 데이터사이언스학부 다중전공 신청이 1학년 말이었던 12월에 반려되었다.\n종강 후에도 앞으로 어떻게 해야 할지 고민하다가, 그 시기에 공지가 올라오는 전과에 도전했다. 2학년이 되던 해였던 2023년의 1월은 대부분의 시간을 방에 틀어박혀서 지냈다. 전과 지원을 위해 포트폴리오로 쓸 거리를 만들고, 그러기 위해 공부도 더 하고, 파이썬 코드도 열심히 돌려보는 것에만 열중했다.\n(그 와중에도 실감 인앱결제 상품을 만들기 위해 이용약관과 개인정보처리방침을 쓰긴 했다...)\n\n 9. 전과 면접에서는 오히려 미분적분학1의 A+ 학점에 대한 얘기가 나와서 수학 공부에 대한 경험을 말했다.\n'고등학교에서 이과는 아니었지만 초월함수의 미분법 등에 관심을 가진 것이 도움이 되었다'는 등의 이야기를 했다.\n전과에 성공하지 못하면 어떻게 해야할까 하는 걱정과, 나는 합격할 수 있을 것이라는 믿음이 혼재되어 미치도록 혼란스러웠던 2023년 1월은 당월 30일에 전과 신청 결재 통보를 받으며 막을 내렸다."
}
